org/blog/React/lifting-state.org
#+title: Lifting state in React
#+date: <2022-05-19 Thu>
#+author: Morgan Walsh
#+description: Learn about lifting state in React
#+keywords: React JavaScript HTML state
#+subtitle: An introduction to lifting state in components

If you haven't read [[./state.org][State with React Hooks]] yet, it could be useful :)

------------------------------

We often add state to components that need it, but what happens if we have multiple components that require the same state... In this article, we will look at how we can share a common state throughout multiple components.

-----------------------------

** The application

This article will build a simple todo list application, without CSS styling, to demonstrate the use of lifting state.

** The parts of the application

In this section, we will explore the different objects and components in the application.

*** The ~Todo~ function

The ~Todo~ object is represented by a function which initialiases its values:

#+name: todo-function
#+caption: The Todo function
#+begin_src js :exports code :eval no-export
  function Todo(id, task, priority) {
    this.id = id;
    this.task = task;
    this.priority = priority;
  }
#+end_src

This function can be used to create ~Todo~ objects which have an id, task and priority.

*** The ~TodoItem~ React component

The ~TodoItem~ is a React function component:

#+name: todo-item-function-component
#+caption: The TodoItem function component
#+begin_src js :exports code :eval no-export
  function TodoItem({ todo }) {
    return (
      <tr>
        <td>{todo.task}</td>
        <td>{todo.priority}</td>
      </tr>
    );
  }
#+end_src

