blog/React/lifting-state.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-26 Thu 22:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Lifting state in React</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Morgan Walsh">
<meta name="description" content="Learn about lifting state in React"
>
<meta name="keywords" content="React JavaScript HTML state">
<link rel='stylesheet' href='/css/style.css' type='text/css' />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a id='toggle'>&equiv;</a>
  <a class='nav-link' href='/'>Home</a>
  <a class='nav-link' href='/blog'>Blog</a>
  <a class='nav-link' href='http://github.com/MrWalshy'>GitHub</a>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Lifting state in React</h1>
<p class="subtitle">An introduction to lifting state in components</p>
</header><p>
If you haven't read <a href="./state.html">State with React Hooks</a> yet, it could be useful :)
</p>

<hr>

<p>
We often add state to components that need it, but what happens if we have multiple components that require the same state&#x2026; In this article, we will look at how we can share a common state throughout multiple components.
</p>

<hr>

<div id="outline-container-org33ad3f8" class="outline-2">
<h2 id="org33ad3f8">The application</h2>
<div class="outline-text-2" id="text-org33ad3f8">
<p>
This article will build a simple todo list application, without CSS styling, to demonstrate the use of lifting state.
</p>
</div>
</div>

<div id="outline-container-orgcf6e771" class="outline-2">
<h2 id="orgcf6e771">The parts of the application</h2>
<div class="outline-text-2" id="text-orgcf6e771">
<p>
In this section, we will explore the different objects and components in the application.
</p>
</div>

<div id="outline-container-org6d77a59" class="outline-3">
<h3 id="org6d77a59">The <code>Todo</code> function</h3>
<div class="outline-text-3" id="text-org6d77a59">
<p>
The <code>Todo</code> object is represented by a function which initialiases its values:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>The Todo function</label><pre class="src src-js" id="orgf0bf778"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">Todo</span>(<span style="font-weight: bold; font-style: italic;">id</span>, <span style="font-weight: bold; font-style: italic;">task</span>, <span style="font-weight: bold; font-style: italic;">priority</span>) {
  <span style="font-weight: bold; text-decoration: underline;">this</span>.id = id;
  <span style="font-weight: bold; text-decoration: underline;">this</span>.task = task;
  <span style="font-weight: bold; text-decoration: underline;">this</span>.priority = priority;
}
</pre>
</div>

<p>
This function can be used to create <code>Todo</code> objects which have an id, task and priority.
</p>
</div>
</div>

<div id="outline-container-orgd1366d1" class="outline-3">
<h3 id="orgd1366d1">The <code>TodoItem</code> React component</h3>
<div class="outline-text-3" id="text-orgd1366d1">
<p>
The <code>TodoItem</code> is a React function component:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>The TodoItem function component</label><pre class="src src-js" id="orgf2403f9"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">TodoItem</span>({ todo }) {
  <span style="font-weight: bold;">return</span> (
    &lt;tr&gt;
      &lt;td&gt;{todo.task}&lt;/td&gt;
      &lt;td&gt;{todo.priority}&lt;/td&gt;
    &lt;/tr&gt;
  );
}
</pre>
</div>
</div>
</div>
