blog/React/lifting-state.html

<div id="outline-container-orge65f29c" class="outline-3">
<h3 id="orge65f29c">The <code>TodoList</code> React component</h3>
<div class="outline-text-3" id="text-orge65f29c">
<p>
The <code>TodoList</code> component renders a todo list with todo items and an add todo input bar:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>The TodoList function component</label><pre class="src src-js" id="org0c73b44"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">TodoList</span>() { 
  <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">todos</span>, <span style="font-weight: bold; font-style: italic;">setTodos</span>] = React.useState([ 
      <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(1, <span style="font-style: italic;">"Feed dog"</span>, <span style="font-style: italic;">"HIGH"</span>), 
      <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(2, <span style="font-style: italic;">"Cook tea"</span>, <span style="font-style: italic;">"HIGH"</span>), 
      <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(3, <span style="font-style: italic;">"Rick roll mother"</span>, <span style="font-style: italic;">"HIGH"</span>), 
      <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(4, <span style="font-style: italic;">"Learn about politics"</span>, <span style="font-style: italic;">"LOW"</span>) 
  ]); 

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">these variables are used by a form for tracking changes</span>
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">to the new todo input fields</span>
  <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">task</span>, <span style="font-weight: bold; font-style: italic;">setTask</span>] = React.useState(<span style="font-weight: bold; text-decoration: underline;">null</span>);
  <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">priority</span>, <span style="font-weight: bold; font-style: italic;">setPriority</span>] = React.useState(<span style="font-style: italic;">"HIGH"</span>);

  <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">addTodo</span>(<span style="font-weight: bold; font-style: italic;">event</span>) { 
      event.preventDefault(); 
      <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">create a new todo using the values of the state we are tracking</span>
      <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">todo</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(Math.floor(Math.random() * 5000), task, priority); 

      setTodos(previousState =&gt; { 
          <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">use the spread operator to copy all of the items in the previous state of</span>
          <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">todos into a new array, and we then also supply the new todo into the new array</span>
          <span style="font-weight: bold;">return</span> [...previousState, todo]; 
      }); 
  }

  <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">handleChange</span>(<span style="font-weight: bold; font-style: italic;">event</span>) {
      <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">get the name attribute of the element that changed</span>
      <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">name</span> = event.target.name;
      <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">get the value of the element that changed</span>
      <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">value</span> = event.target.value;

      <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">decide which piece of state to update</span>
      <span style="font-weight: bold;">switch</span> (name) {
          <span style="font-weight: bold;">case</span> <span style="font-style: italic;">"task"</span>:
              setTask(value);
              <span style="font-weight: bold;">break</span>;
          <span style="font-weight: bold;">case</span> <span style="font-style: italic;">"priority"</span>:
              setPriority(value);
      }
  }

  <span style="font-weight: bold;">return</span> ( 
      &lt;div&gt; 
          {<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">This table renders the todo lists currently tracked in state */</span>}
          &lt;table&gt; 
              &lt;thead&gt; 
                  &lt;tr&gt;
                      &lt;th&gt;Task&lt;/th&gt; 
                      &lt;th&gt;Priority&lt;/th&gt; 
                  &lt;/tr&gt;
              &lt;/thead&gt; 
              &lt;tbody&gt; 
                  {todos.map(todo =&gt; &lt;TodoItem key={todo.id} todo={todo} /&gt;)}
              &lt;/tbody&gt; 
          &lt;/table&gt; 

          {<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">this form is for adding new todos */</span>}
          &lt;form onSubmit={addTodo}&gt; 
              &lt;label htmlFor=<span style="font-style: italic;">"task"</span>&gt;Task&lt;/label&gt; 
              &lt;input id=<span style="font-style: italic;">"task"</span> name=<span style="font-style: italic;">"task"</span> type=<span style="font-style: italic;">"text"</span> placeholder=<span style="font-style: italic;">"Feed the dog"</span> required onChange={handleChange} /&gt; 

              &lt;label htmlFor=<span style="font-style: italic;">"priority"</span>&gt;Priority&lt;/label&gt; 
              &lt;select id=<span style="font-style: italic;">"priority"</span> name=<span style="font-style: italic;">"priority"</span> size=<span style="font-style: italic;">"2"</span> defaultValue=<span style="font-style: italic;">"HIGH"</span> required onChange={handleChange}&gt; 
                  &lt;option value=<span style="font-style: italic;">"HIGH"</span>&gt;High&lt;/option&gt; 
                  &lt;option value=<span style="font-style: italic;">"LOW"</span>&gt;Low&lt;/option&gt; 
              &lt;/select&gt;
              &lt;br /&gt;&lt;br /&gt;
              &lt;button type=<span style="font-style: italic;">"submit"</span>&gt;Add todo&lt;/button&gt;
          &lt;/form&gt; 
      &lt;/div&gt; 
  ); 
}
</pre>
</div>

<p>
In the current design, our state is in the component which makes sense - the <code>TodoList</code> - but it does not make sense for the state for creating a new todo item to be managed
in the parent <code>TodoList</code> component.
</p>

<p>
We can refactor the <code>TodoList</code> to use a <code>AddTodo</code> component:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>The AddTodoItem function component</label><pre class="src src-js" id="org8464a34"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">AddTodoItem</span>(<span style="font-weight: bold; font-style: italic;">props</span>) {

  <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">task</span>, <span style="font-weight: bold; font-style: italic;">setTask</span>] = React.useState(<span style="font-weight: bold; text-decoration: underline;">null</span>);
  <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">priority</span>, <span style="font-weight: bold; font-style: italic;">setPriority</span>] = React.useState(<span style="font-style: italic;">"HIGH"</span>);

  <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">handleChange</span>(<span style="font-weight: bold; font-style: italic;">event</span>) {
      <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">name</span> = event.target.name;
      <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">value</span> = event.target.value;
      console.log(name);
      <span style="font-weight: bold;">switch</span> (name) {
          <span style="font-weight: bold;">case</span> <span style="font-style: italic;">"task"</span>:
              setTask(value);
              <span style="font-weight: bold;">break</span>;
          <span style="font-weight: bold;">case</span> <span style="font-style: italic;">"priority"</span>:
              setPriority(value);
      }
  }

  <span style="font-weight: bold;">return</span> (
      &lt;form&gt; 
          &lt;label htmlFor=<span style="font-style: italic;">"task"</span>&gt;Task&lt;/label&gt; 
          &lt;input id=<span style="font-style: italic;">"task"</span> name=<span style="font-style: italic;">"task"</span> type=<span style="font-style: italic;">"text"</span> placeholder=<span style="font-style: italic;">"Feed the dog"</span> required onChange={handleChange} /&gt; 

          &lt;label htmlFor=<span style="font-style: italic;">"priority"</span>&gt;Priority&lt;/label&gt; 
          &lt;select id=<span style="font-style: italic;">"priority"</span> name=<span style="font-style: italic;">"priority"</span> size=<span style="font-style: italic;">"2"</span> defaultValue=<span style="font-style: italic;">"HIGH"</span> required onChange={handleChange}&gt; 
              &lt;option value=<span style="font-style: italic;">"HIGH"</span>&gt;High&lt;/option&gt; 
              &lt;option value=<span style="font-style: italic;">"LOW"</span>&gt;Low&lt;/option&gt; 
          &lt;/select&gt;
          &lt;br /&gt;&lt;br /&gt;
          &lt;button type=<span style="font-style: italic;">"submit"</span>&gt;Add todo&lt;/button&gt;
      &lt;/form&gt; 
  );
}
</pre>
</div>

<p>
Now that we have this component, we can use it in the <code>TodoList</code> instead of leaving the form directly in there:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>The TodoList function component, slightly revised</label><pre class="src src-js" id="org9a91c90">  <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">TodoList</span>() {

    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">if multiple components require the same state (values), </span>
    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">we put the state in the highest parent component which requires that state</span>
    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">otherwise we should put the state only in the component that needs it</span>

    <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">todos</span>, <span style="font-weight: bold; font-style: italic;">setTodos</span>] = React.useState([ 
        <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(1, <span style="font-style: italic;">"Feed dog"</span>, <span style="font-style: italic;">"HIGH"</span>), 
        <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(2, <span style="font-style: italic;">"Cook tea"</span>, <span style="font-style: italic;">"HIGH"</span>), 
        <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(3, <span style="font-style: italic;">"Rick roll mother"</span>, <span style="font-style: italic;">"HIGH"</span>), 
        <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(4, <span style="font-style: italic;">"Learn about politics"</span>, <span style="font-style: italic;">"LOW"</span>) 
    ]); 

    <span style="font-weight: bold;">return</span> ( 
        &lt;div&gt; 
            &lt;table&gt; 
                &lt;thead&gt; 
                    &lt;tr&gt;
                        &lt;th&gt;Task&lt;/th&gt; 
                        &lt;th&gt;Priority&lt;/th&gt; 
                    &lt;/tr&gt;
                &lt;/thead&gt; 
                &lt;tbody&gt; 
                    {todos.map(todo =&gt; &lt;TodoItem key={todo.id} todo={todo} /&gt;)}
                &lt;/tbody&gt; 
            &lt;/table&gt; 
            &lt;AddTodoItem /&gt;
        &lt;/div&gt; 
    ); 
}
</pre>
</div>

<p>
Now, the problem is: How do we create a new todo item in the <code>AddTodoItem</code> component and insert it into the array of todos in <code>TodoList</code>?
</p>

<p>
To solve this, we should pass the <code>setTodos</code> function which controls the state of <code>todos</code> as props to the component that will need to modify the array. This will
look as follows:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>The TodoList function component revised</label><pre class="src src-js" id="org509b6fe">  <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">TodoList</span>() {

    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">if multiple components require the same state (values), </span>
    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">we put the state in the highest parent component which requires that state</span>
    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">otherwise we should put the state only in the component that needs it</span>

    <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">todos</span>, <span style="font-weight: bold; font-style: italic;">setTodos</span>] = React.useState([ 
        <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(1, <span style="font-style: italic;">"Feed dog"</span>, <span style="font-style: italic;">"HIGH"</span>), 
        <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(2, <span style="font-style: italic;">"Cook tea"</span>, <span style="font-style: italic;">"HIGH"</span>), 
        <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(3, <span style="font-style: italic;">"Rick roll mother"</span>, <span style="font-style: italic;">"HIGH"</span>), 
        <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(4, <span style="font-style: italic;">"Learn about politics"</span>, <span style="font-style: italic;">"LOW"</span>) 
    ]); 

    <span style="font-weight: bold;">return</span> ( 
        &lt;div&gt; 
            &lt;table&gt; 
                &lt;thead&gt; 
                    &lt;tr&gt;
                        &lt;th&gt;Task&lt;/th&gt; 
                        &lt;th&gt;Priority&lt;/th&gt; 
                    &lt;/tr&gt;
                &lt;/thead&gt; 
                &lt;tbody&gt; 
                    {todos.map(todo =&gt; &lt;TodoItem key={todo.id} todo={todo} /&gt;)}
                &lt;/tbody&gt; 
            &lt;/table&gt; 
            &lt;AddTodoItem setTodos={setTodos} /&gt;
        &lt;/div&gt; 
    ); 
}
</pre>
</div>

<p>
The key part is <code>&lt;AddTodoItem setTodos={setTodos} /&gt;</code> where we pass the function as props. We then modify <code>AddTodoItem</code> to destructure <code>setTodos</code> from props
and create an additional <code>addTodo</code> function which is called when the form is submitted:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>The AddTodoItem function component</label><pre class="src src-js" id="org8b80d96"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">AddTodoItem</span>({ setTodos }) {

  <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">task</span>, <span style="font-weight: bold; font-style: italic;">setTask</span>] = React.useState(<span style="font-weight: bold; text-decoration: underline;">null</span>);
  <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">priority</span>, <span style="font-weight: bold; font-style: italic;">setPriority</span>] = React.useState(<span style="font-style: italic;">"HIGH"</span>);

  <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">handleChange</span>(<span style="font-weight: bold; font-style: italic;">event</span>) {
      <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">...</span>
  }

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">use the setTodos function to lift the new todo item into the todos array</span>
  <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">addTodo</span>(<span style="font-weight: bold; font-style: italic;">event</span>) { 
      event.preventDefault(); 
      <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">todo</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Todo</span>(Math.floor(Math.random() * 5000), task, priority); 

      setTodos(previousState =&gt; { 
          <span style="font-weight: bold;">return</span> [...previousState, todo]; 
      }); 
  }

  <span style="font-weight: bold;">return</span> (
      &lt;form onSubmit={addTodo}&gt; 
          &lt;label htmlFor=<span style="font-style: italic;">"task"</span>&gt;Task&lt;/label&gt; 
          &lt;input id=<span style="font-style: italic;">"task"</span> name=<span style="font-style: italic;">"task"</span> type=<span style="font-style: italic;">"text"</span> placeholder=<span style="font-style: italic;">"Feed the dog"</span> required onChange={handleChange} /&gt; 

          &lt;label htmlFor=<span style="font-style: italic;">"priority"</span>&gt;Priority&lt;/label&gt; 
          &lt;select id=<span style="font-style: italic;">"priority"</span> name=<span style="font-style: italic;">"priority"</span> size=<span style="font-style: italic;">"2"</span> defaultValue=<span style="font-style: italic;">"HIGH"</span> required onChange={handleChange}&gt; 
              &lt;option value=<span style="font-style: italic;">"HIGH"</span>&gt;High&lt;/option&gt; 
              &lt;option value=<span style="font-style: italic;">"LOW"</span>&gt;Low&lt;/option&gt; 
          &lt;/select&gt;
          &lt;br /&gt;&lt;br /&gt;
          &lt;button type=<span style="font-style: italic;">"submit"</span>&gt;Add todo&lt;/button&gt;
      &lt;/form&gt; 
  );
}
</pre>
</div>

<p>
This will then lift the new state, when the form is submitted, into the <code>TodoList</code> component which passes the <code>setTodos</code> function.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr />
<footer>
  <p>
    Last updated 2022-05-26 Thu 22:27. <br />
    Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9). <br />
    <a href="/html/bug-report.html">Submit a bug report</a>
  </p>
  <p><small>Copyright 2022 Morgan Walsh.</small></p>
</footer>
<script src='/js/navbar.js'></script>
</div>
</body>
</html>
